Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РаботаСНоменклатуройКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает содержание услуги с учетом периодичности.
// Например, "Сопровождение 1С за сентябрь 2016"
//
// Параметры:
//    НаименованиеПолное - Строка - Полное наименование номенклатуры.
//    Периодичность - Перечисление.Периодичность - Поддерживаются месяц, квартал и год.
//    Дата - Дата - Дата для формирования содержания.
//
//++ЭЛИАС 20190916 
//Функция СодержаниеУслуги(Знач НаименованиеПолное, Знач ПериодичностьУслуги, Знач Дата, Знач УказыватьГод = Истина) Экспорт
Функция СодержаниеУслуги(Знач НаименованиеПолное, Знач ПериодичностьУслуги, Знач Дата, Знач УказыватьГод = Истина, ВидПериода = Неопределено) Экспорт
//--ЭЛИАС 20190916
	
	Если НЕ ЗначениеЗаполнено(ПериодичностьУслуги) ИЛИ ПустаяСтрока(НаименованиеПолное) Тогда
		Возврат НаименованиеПолное;
	КонецЕсли;
	
	ШаблонСтроки = НСтр("ru='за %1'");
	ЧастиСодержания = Новый Массив;
	ЧастиСодержания.Добавить(НаименованиеПолное);
	
	ФорматДаты = "";
	//++ЭЛИАС 20190916 
	//Если ПериодичностьУслуги = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
	Если ЗначениеЗаполнено(ВидПериода) Тогда
		Если ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод") Тогда
			Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
		Иначе
			Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность." + Строка(ВидПериода));
		КонецЕсли;
		ОкончаниеПериода = АР_ПроцедурыНачисления.КонецПериода(Дата, Периодичность);
		ЧастиСодержания.Добавить("за");
		ЧастиСодержания.Добавить(НРег(ПредставлениеПериода(Дата, ОкончаниеПериода)));
		Возврат СтрСоединить(ЧастиСодержания, " ");
	ИначеЕсли ПериодичностьУслуги = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
	//--ЭЛИАС 20190916
		ФорматДаты = "MMMM %1";
	ИначеЕсли ПериодичностьУслуги = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		ФорматДаты = "к ""квартал"" %1";
	ИначеЕсли ПериодичностьУслуги = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		ФорматДаты = "%1";
	КонецЕсли;
	
	ФорматДаты = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ФорматДаты, ?(УказыватьГод, "yyyy ""г.""", ""));
	
	Если НЕ ПустаяСтрока(ФорматДаты) Тогда
		ЧастиСодержания.Добавить(СтрШаблон(ШаблонСтроки, НРег(Формат(Дата, "Л=ru_RU; ДФ='"+ФорматДаты+"'"))));
	КонецЕсли; 
	
	Возврат СтрСоединить(ЧастиСодержания, " ");
	
КонецФункции

#КонецОбласти
